post-api/app/controllers/api/v1/comments_controller.rb

    def create
        @comment = Comment.create(comment_params)
---
INSERT INTO "comments" ("post_id", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["post_id", 44], ["body", "asdf"], ["created_at", "2020-11-12 00:52:45.394918"], ["updated_at", "2020-11-12 00:52:45.394918"]]