post-api/app/controllers/api/v1/posts_controller.rb

    def create
        @post = Post.create(post_params)
        @post.comments.create!(body: "This is the first comment!")
---
INSERT INTO "posts" ("body", "created_at", "updated_at") VALUES (?, ?, ?)  [["body", "second post"], ["created_at", "2020-10-23 23:07:41.599444"], ["updated_at", "2020-10-23 23:07:41.599444"]]
INSERT INTO "posts" ("body", "created_at", "updated_at") VALUES (?, ?, ?)  [["body", "first post"], ["created_at", "2020-11-11 23:18:21.061195"], ["updated_at", "2020-11-11 23:18:21.061195"]]
INSERT INTO "comments" ("post_id", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["post_id", 14], ["body", "This is the first comment!"], ["created_at", "2020-10-23 23:34:49.900947"], ["updated_at", "2020-10-23 23:34:49.900947"]]

    def destroy
        @post = Post.find(params[:id])
        @post.delete
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 10]]